Examinator/src/Enums/ГруппировкиОбученийВебКабинетаСУО/ГруппировкиОбученийВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппировкиОбученийВебКабинетаСУО</name>
  <enumValues>
    <name>БезГруппировки</name>
  </enumValues>
  <enumValues>
    <name>ВидОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПрограммаОбучения</name>
  </enumValues>
  <enumValues>
    <name>Дисциплина</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>Статус</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ГруппировкиОбученийВебКабинетаСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция НоваяТаблицаИспользованияГруппировок() Экспорт
	
	ЭтоПолныйИнтерфейс = ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО");
	
	ТаблицаГруппировок = Новый ТаблицаЗначений;
	ТаблицаГруппировок.Колонки.Добавить("Группировка");
	ТаблицаГруппировок.Колонки.Добавить("Использовать");
	ТаблицаГруппировок.Колонки.Добавить("Наименование_ru");
	ТаблицаГруппировок.Колонки.Добавить("Наименование_en");
	
	Для каждого Группировка Из Перечисления.ГруппировкиОбученийВебКабинетаСУО Цикл
		
		Если (Группировка = Перечисления.ГруппировкиОбученийВебКабинетаСУО.ПрограммаОбучения
			ИЛИ Группировка = Перечисления.ГруппировкиОбученийВебКабинетаСУО.ВидОбучения)
			И НЕ ЭтоПолныйИнтерфейс Тогда
			
			Продолжить;
			
		КонецЕсли;
			
		НоваяСтрока = ТаблицаГруппировок.Добавить();
		НоваяСтрока.Группировка = Группировка;
		НоваяСтрока.Использовать = Ложь;
	   	НоваяСтрока.Наименование_ru = Строка(Группировка);
		НоваяСтрока.Наименование_en = ВебКабинетСУ.Перевод(НоваяСтрока.Наименование_ru, "ГруппировкиОбучений", "RU", "EN");
	КонецЦикла;
	
	Возврат ТаблицаГруппировок;
	
КонецФункции

Функция ИмяГруппировкиДляНастройкиВебКабинета(Группировка) Экспорт
	
	Если Группировка = Перечисления.ГруппировкиОбученийВебКабинетаСУО.БезГруппировки Тогда
		Возврат "default";
	КонецЕсли;
	
	Если Группировка = Перечисления.ГруппировкиОбученийВебКабинетаСУО.ВидОбучения Тогда
		Возврат "kindEducation";
	КонецЕсли;
	
	Если Группировка = Перечисления.ГруппировкиОбученийВебКабинетаСУО.ПрограммаОбучения Тогда
		Возврат "module";
	КонецЕсли;
	
	Если Группировка = Перечисления.ГруппировкиОбученийВебКабинетаСУО.Дисциплина Тогда
		Возврат "subject";
	КонецЕсли;
	
	Если Группировка = Перечисления.ГруппировкиОбученийВебКабинетаСУО.Неделя Тогда
		Возврат "week";
	КонецЕсли;
	
	Если Группировка = Перечисления.ГруппировкиОбученийВебКабинетаСУО.Месяц Тогда
		Возврат "month";
	КонецЕсли;
	
	Если Группировка = Перечисления.ГруппировкиОбученийВебКабинетаСУО.Год Тогда
		Возврат "year";
	КонецЕсли;	
	
	Если Группировка = Перечисления.ГруппировкиОбученийВебКабинетаСУО.Статус Тогда
		Возврат "status";
	КонецЕсли;
	
	Возврат "default";
	
КонецФункции

#КонецОбласти

#КонецЕсли
